
## Plan Result

[CI link](https://github.com/shima8823/cloud-wp/actions/runs/22251750203)


<pre><code>Plan: 20 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_instance_profile.ec2_ssm
  * aws_iam_role.ec2_ssm
  * aws_iam_role_policy.ec2_ssm_s3_access
  * aws_iam_role_policy_attachment.ec2_ssm_core
  * aws_instance.wordpress
  * aws_internet_gateway.main
  * aws_route.public_default
  * aws_route_table.public
  * aws_route_table_association.public_1a
  * aws_s3_bucket.ssm_artifacts
  * aws_s3_bucket_lifecycle_configuration.ssm_artifacts
  * aws_security_group.ec2
  * aws_subnet.public_1a
  * aws_vpc.main
  * aws_vpc_security_group_egress_rule.egress_dns_tcp
  * aws_vpc_security_group_egress_rule.egress_dns_udp
  * aws_vpc_security_group_egress_rule.egress_http
  * aws_vpc_security_group_egress_rule.egress_https
  * aws_vpc_security_group_ingress_rule.ingress_http
  * aws_vpc_security_group_ingress_rule.ingress_https


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_instance_profile.ec2_ssm will be created
  + resource "aws_iam_instance_profile" "ec2_ssm" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2-ssm-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2-ssm-role"
      + tags_all    = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2_ssm will be created
  + resource "aws_iam_role" "ec2_ssm" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2-ssm-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.ec2_ssm_s3_access will be created
  + resource "aws_iam_role_policy" "ec2_ssm_s3_access" {
      + id          = (known after apply)
      + name        = "ssm-s3-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.ec2_ssm_core will be created
  + resource "aws_iam_role_policy_attachment" "ec2_ssm_core" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "ec2-ssm-role"
    }

  # aws_instance.wordpress will be created
  + resource "aws_instance" "wordpress" {
      + ami                                  = "ami-0836e97b3d843dd82"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ec2-ssm-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "ap-northeast-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "wordpress"
        }
      + tags_all                             = {
          + "ManagedBy" = "terraform"
          + "Name"      = "wordpress"
          + "Project"   = "cloud-wp/app"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + primary_network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "ap-northeast-1"
      + tags_all = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.public_default will be created
  + resource "aws_route" "public_default" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "ap-northeast-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-northeast-1"
      + route            = (known after apply)
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public_1a will be created
  + resource "aws_route_table_association" "public_1a" {
      + id             = (known after apply)
      + region         = "ap-northeast-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.ssm_artifacts will be created
  + resource "aws_s3_bucket" "ssm_artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "ansible-ssm-bucket"
        }
      + tags_all                    = {
          + "ManagedBy" = "terraform"
          + "Name"      = "ansible-ssm-bucket"
          + "Project"   = "cloud-wp/app"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.ssm_artifacts will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "ssm_artifacts" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ap-northeast-1"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "cleanup"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 1
              + expired_object_delete_marker = false
            }
        }
    }

  # aws_security_group.ec2 will be created
  + resource "aws_security_group" "ec2" {
      + arn                    = (known after apply)
      + description            = "Security group for the WordPress EC2 instance."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "fw-ec2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-1"
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.public_1a will be created
  + resource "aws_subnet" "public_1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags_all                                       = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "ap-northeast-1"
      + tags_all                             = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
    }

  # aws_vpc_security_group_egress_rule.egress_dns_tcp will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_dns_tcp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.2/32"
      + from_port              = 53
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "ap-northeast-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + to_port                = 53
    }

  # aws_vpc_security_group_egress_rule.egress_dns_udp will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_dns_udp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.2/32"
      + from_port              = 53
      + id                     = (known after apply)
      + ip_protocol            = "udp"
      + region                 = "ap-northeast-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + to_port                = 53
    }

  # aws_vpc_security_group_egress_rule.egress_http will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "ap-northeast-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + to_port                = 80
    }

  # aws_vpc_security_group_egress_rule.egress_https will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "ap-northeast-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + to_port                = 443
    }

  # aws_vpc_security_group_ingress_rule.ingress_http will be created
  + resource "aws_vpc_security_group_ingress_rule" "ingress_http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "ap-northeast-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + to_port                = 80
    }

  # aws_vpc_security_group_ingress_rule.ingress_https will be created
  + resource "aws_vpc_security_group_ingress_rule" "ingress_https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "ap-northeast-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "ManagedBy" = "terraform"
          + "Project"   = "cloud-wp/app"
        }
      + to_port                = 443
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ansible_ssm_bucket_name = (known after apply)
  + instance_id             = (known after apply)
  + public_ip               = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":31,"Program":"tfcmt","SHA1":"ccc70486fbdea39086dc48ef8ae28a7a62934758","Vars":{},"WorkflowName":"Terraform Plan"} -->